Netology/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Netology/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Netology/src/Catalogs/Контрагенты/ObjectModule.bsl
Функция ТолькоЦифрыВСтроке(Знач ПроверяемаяСтрока)
	
	Цифры = "0123456789";
	Для Счетчик = 1 По СтрДлина(ПроверяемаяСтрока) Цикл
		Символ = Сред(ПроверяемаяСтрока, Счетчик, 1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    Сообщить("Обработка проверки заполнения: " + КонтекстВыполненияКлиентСервер.ТекущийКонтекст());
	
	Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		//Проверка ИНН для юридического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 10 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица ИНН должен быть заполнен и состоять из 10 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ТолькоЦифрыВСтроке(ИНН) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ РаботаСИНН.ИННВерен(ИНН) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Контрольная сумма ИНН не совпадает, проверьте правильность ввода'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		// Проверка КПП для юридического лица
		Если НЕ ЗначениеЗаполнено(КПП) ИЛИ СтрДлина(КПП) <> 9 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица КПП должен быть заполнен и состоять из 9 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ТолькоЦифрыВСтроке(КПП) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'КПП должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		
		//Проверка ИНН для Физического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 12 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица ИНН должен быть заполнен и состоять из 12 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ТолькоЦифрыВСтроке(ИНН) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);	
		КонецЕсли;
		
		// Проверка КПП для Физического лица
		Если ЗначениеЗаполнено(КПП) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица КПП должен быть не заполнен'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;

				
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя; 

КонецПроцедуры
